[{"id": "IO18z", "title": "Gorgeous registered Ragdoll kitten.", "desc": "Gorgeous registered Ragdoll kitten. contact us directly for more info and pictures by clic", "location": "Houston, Texas", "posted": "2018-02-25", "updated": "2018-02-25", "breed": "Ragdoll", "price": "$700", "content": "Gorgeous registered Ragdoll kitten. contact us directly for more info and pictures by clicking the link below or copy and paste on your browser.\nimageshack.com/a/img923/194/ClSa63.jpg", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/tAp243uNM0.jpg", "detail_url": "http://www.hoobly.com/IO18z/gorgeous-registered-ragdoll-kitten.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/tAp243uNM0.jpg"]}, {"id": "Vgc6y", "title": "Ragdoll kitten (last one)", "desc": "Ragdoll kitten, Female,9 weeks old, vet checked and happy!  Parents are on premises and he", "location": "Rolling Meadows, Illinois", "posted": "2018-02-25", "updated": "2018-02-25", "breed": "Ragdoll", "price": "$300", "content": "Ragdoll kitten, Female,9 weeks old, vet checked and happy!  Parents are on premises and healthy.  Asking $300. Text Jen if interested 847 305 9948.  Thank you!!", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/X3msZIOd2d.jpg", "detail_url": "http://www.hoobly.com/Vgc6y/ragdoll-kitten-last-one.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/X3msZIOd2d.jpg"]}, {"id": "0RuS3", "title": "Ragdoll kittens many colores to pick from !", "desc": "Family raised with kids. \r\nVery lovable and friendly. \r\nShots and wormed. \r\nWe meet in pub", "location": "Wadsworth, Ohio", "posted": "2018-02-25", "updated": "2018-02-25", "breed": "Ragdoll", "price": "$700", "content": "Family raised with kids.\n\nVery lovable and friendly.\n\nShots and wormed.\n\nWe meet in public place for safety.\n\nKittens come with health guarantee contract and shot records.\n\nKittens will be ready march 8th when they are 8 weeks old.\n\nMale lilac lynx  Female lilac lynx\n\nSeal bicolor male\n\nSeal bicolor female -pending\n\nSeal point  female\n\nBlue point male\n\nNo papers for 700.00 this is pet home only price. We prefer our kittens go to pet homes.\n\nParents have been screen and tested for gentic issues and are fel/fiv negative.\n\nWe do not ship our kitten.\n\nCash only at pick up. text for more info or email (440) 252-054three", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/lu94N59f8T.jpg", "detail_url": "http://www.hoobly.com/0RuS3/ragdoll-kittens-many-colores-to-pick-from.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/7d8FT5bW9x.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/TYHFPRokVq.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/i83bjRXWva.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/k530Nt6cpR.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/lu94N59f8T.jpg"]}, {"id": "eK2pg", "title": "1.5 year old male seal point mink ragdoll            proven stud           he does not spray", "desc": "I have  stunning seal point mink male 1.5 yrs old I have had since he was born. he is swee", "location": "Shirley, Massachusetts", "posted": "2017-10-28", "updated": "2018-02-25", "breed": "Ragdoll", "price": "$500", "content": "I have  stunning seal point mink male 1.5 yrs old I have had since he was born. he is sweet and loving.  I was going to use him for breeding but  his sire keeps attacking him,  I feel he would  get a better home  than hiding from his dad  all the time. He does not get along with dogs.  I have been breeding for 6yrs  my pets are FIV/Felv negative.  I do not give TICA papers pet price is 500.00 breeding rights are 800.00 sorry pictures are bad I will try for new ones  here are some of his babys too", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/Hswh9KCQBb.jpg", "detail_url": "http://www.hoobly.com/eK2pg/year-old-male-seal-point-mink.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/Hswh9KCQBb.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/NrRWl7YHbW.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/h4eqq2ZSio.jpg"]}, {"id": "yKOqj", "title": "Mink Ragdoll for Adoption", "desc": "Beautiful full blooded Mink Ragdoll male cat for adoption. Riley is 3.5 years old.  He has", "location": "Spartanburg, South Carolina", "posted": "2018-01-30", "updated": "2018-02-25", "breed": "Ragdoll", "price": "$250", "content": "Beautiful full blooded Mink Ragdoll male cat for adoption. Riley is 3.5 years old.  He has been neutered.  He is fully clawed.  He is a loving part of our family.  He has been raised with my 2 girls and Tortoiseshell cat.  Unfortunately, due to my health condition and my daughter's allergies we are unable to keep him.  He is very loving and affectionate.  He gets along well with other cats but not dogs.  He has a favorite pillow he loves to sleep on.\n\nHe truly will be a special addition to your family!\r\n(Serious inquiries only please)", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/HEqdDyhOhm.jpg", "detail_url": "http://www.hoobly.com/yKOqj/mink-ragdoll-for-adoption.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/HEqdDyhOhm.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/Keut1WRrvm.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/aTeSbji6YU.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/xp4h9wVlnO.jpg"]}, {"id": "tcqDz", "title": "Unregistered Ragdolls", "desc": "Hello we have 2 female Ragdolls left available for a small rehoming fee. Please visit Roll", "location": "Matamoras, Pennsylvania", "posted": "2018-02-25", "updated": "2018-02-25", "breed": "Ragdoll", "price": "$700", "content": "Hello we have 2 female Ragdolls left available for a small rehoming fee. Please visit Rolling Creek Ragdolls Facebook Page and text me for more information. One female (Cammy) is a perfect bicolor high mitted ragdoll with a white tip at end of tail. The other (Clarabell) is also a bicolor but has Mom black imperfection near the nose. She has more of a tortie look. Both are sweet and loving and just learning the litter box and eating food. They are both 4 weeks old. They will be able to go to a good home in 4-6 weeks. Pictures are provided of them and both Mom and Dad. Dad is a seal point lynx carrying chocolate and Mom is a white tortie. Pet Price", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/VfEbyVsbnZ.jpg", "detail_url": "http://www.hoobly.com/tcqDz/unregistered-ragdolls.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/07HBDPnnVr.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/6Kh9f785Ul.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/7P5H5BAXLS.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/DxiiKHuUJi.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/FAuanyCUAZ.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/J2g3KfDrga.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/JomIhmyRvp.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/MUHhLadVDD.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/MpfG3st2q0.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/P8Cfv3lL53.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/RDgDcfcRjb.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/RvEz36rJrA.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/VfEbyVsbnZ.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/eHsedzBSZW.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/ew8d8NtTUG.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/fpP90E5KFP.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/grkPETUU4B.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/iflcsmI8yk.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/jzP8q5kYuX.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/lvgTQY4VIL.jpg"]}, {"id": "guVjm", "title": "Adorable Ragdoll kitten", "desc": "Cute and fluffy female Ragdoll kitten.  Just 8 weeks old. Beautiful seal point coloring, w", "location": "Glastonbury, Connecticut", "posted": "2018-02-25", "updated": "2018-02-25", "breed": "Ragdoll", "price": "$850", "content": "Cute and fluffy female Ragdoll kitten.  Just 8 weeks old. Beautiful seal point coloring, with silky soft fur and gorgeous blue eyes. Playful and affectionate disposition — likes to cuddle :)\n\nComes with first shots and deworming. Ready for immediate adoption.\n\nCall or email Daniel:\n\n860-328-5176\nEmail Me Here", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/dXKSMl62aO.jpg", "detail_url": "http://www.hoobly.com/guVjm/adorable-ragdoll-kitten.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/5lgCqQDUlQ.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/dXKSMl62aO.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/lsniswfW48.jpg"]}, {"id": "TxGwg", "title": "Beautiful, Purebred Ragdoll girl Chanel is expecting her 4th Litter!!!", "desc": "Our wonderful purebred Ragdoll girl Chanel is now expecting her 4th litter. She has had 3 ", "location": "West Haverstraw, New York", "posted": "2018-02-04", "updated": "2018-02-25", "breed": "Ragdoll", "price": "$600", "content": "Our wonderful purebred Ragdoll girl Chanel is now expecting her 4th litter. She has had 3 amazing litters of 5-6 kittens each time. She has had seal points, seal mitted, blue points, blue mitted, flame points, torties and kittens with blazes. The kittens go fast! You can reserve a kitten for your family now with a small fee. With a non-refundable $200 deposit you allow us to keep a kitten for you and allow you first choice of litter.  We are a very small in home cattery, raising our kittens as family above all. The kittens will be used to dogs, other cats, and birds! As well as children teasing at them so no worry there. They will be completely social, hand held from the day they come into this life. They will be totally playful, played with as soon as they can walk. And most importantly they will love you for the rest of their lives.\n\nThe kittens will be FeLv, FiV, HCM, MPS as well as IGG and IGM negative. The kittens prices vary from $600 and up, depending on their colors and patterns. The $200 deposit is deducted from the original price of the kitten. We offer a 1 year health guarantee and offer lifetime support, we will gladly answer any questions and will gladly receive any update on the kittens new life.  As well a portion of all adoption costs goes to local shelters and organizations to help the abused and stray animals.  If you are ready for a lifetime amount of love and a photo camera full of purrrrfect pictures message me and lets get started on finding you a new friend!!!\n\nFeel free to call or message me anytime at (845) 553-4454. We have multiple available photos of her and her past litters.", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/cIMLePM0CN.jpg", "detail_url": "http://www.hoobly.com/TxGwg/beautiful-purebred-ragdoll-girl-chanel-is-expecting-her-th-litter.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/3uMqXX3c3v.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/3xr9Sbtmk3.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/IFqjj7ayD5.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/cIMLePM0CN.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/fX7e1gd5b7.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/itHduxzOce.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/l8GG8LNrbS.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/lvVmYtcpNf.jpg"]}, {"id": "ScH2x", "title": "Hayley Genuine Ragdoll Female Seal Point Mitted Pointed Kitten For Sale Adoption With Multiple Supreme Grand Champion Bloodlines TICA Pedigreed Purebred", "desc": "Hayley is a Genuine female seal point mitted pointed Multiple Generation TICA Pedigreed Pu", "location": "Haines City, Florida", "posted": "2018-02-07", "updated": "2018-02-25", "breed": "Ragdoll", "price": "", "content": "Hayley is a Genuine female seal point mitted pointed Multiple Generation TICA Pedigreed Purebred Ragdoll Kitten raised with my five children and with my other cats with multiple Supreme Grand Champion Bloodlines plus a dozen plus more awards and my dogs (dog and children friendly!) can go home March 9th (or later if desired). Suburban home hobby bred and raised with my five young children ages nine through seventeen. Excellent dispositions and unequaled temperaments; I can't stress enough how great it is that my Genuine Ragdoll Cats and Kittens are well socialized with my multiple children and other pets. My family raises top quality true TICA Ragdoll Cats and kittens - beware of the fakes - those without pedigrees (anyone can claim \"pure bred\" but without a pedigree to back it up - who knows what you are really getting!) or without registered parents! My cats were bred from breeders with multiple generations of their family being breeders and over fifty years combined experience to bring out the best in the breed. Over a dozen champion bloodlines are in all my pets including but not limited to multiple Supreme Grand Champion. $1995 adoption fee for pet homes for females and when they go to their new homes my quality kittens will have; Parental Genetic Testing, Parental Blood Tests and Health Screenings, Veterinarian Health Examination and Veterinarian Health Certification Certificate, and Multiple Current Vaccinations, Multiple Blood Tests, Health Guarantee and it is all in writing! My kittens come from parents with a Genuine multiple generation pedigree, TICA Registration, and more. Previous litters have been Blue Mitted, Blue Lynx, Blue Bicolor, Seal BiColor, Seal Point, Seal Mitted, Colorpoint, Chocolate, Lilac and others. Please TEXT to get the quickest response or call 610-235-six446-no-spam-please or visit my site;\n\nragdollkittensdivine.com\n\n180702", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/jqlh2t5Tk6.jpg", "detail_url": "http://www.hoobly.com/ScH2x/hayley-genuine-ragdoll-female-seal-point-mitted-pointed-kitten-for-sale-adoption-with-multiple-supreme-grand-champion-bloodlines-tica-pedigreed-purebred.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/jqlh2t5Tk6.jpg"]}, {"id": "cjoEm", "title": "Adorea Genuine Ragdoll Female Seal Bicolor Kitten For Sale Adoption With Multiple Supreme Grand Champion Bloodlines TICA Pedigreed Purebred", "desc": "Genuine female seal bicolor Multiple Generation TICA Pedigreed Purebred Ragdoll Kitten rai", "location": "Haines City, Florida", "posted": "2018-01-21", "updated": "2018-02-25", "breed": "Ragdoll", "price": "", "content": "Genuine female seal bicolor Multiple Generation TICA Pedigreed Purebred Ragdoll Kitten raised with my five children and with my other cats with multiple Supreme Grand Champion Bloodlines and a dozen plus more awards and my dogs (dog and children friendly!) Suburban home hobby bred and raised with my five young children ages eight through seventeen. Excellent dispositions and unequaled temperaments; I can't stress enough how great it is that my Genuine Ragdoll Cats and Kittens are well socialized with my multiple children and other pets. My family raises top quality true TICA Ragdoll Cats and kittens - beware of the fakes - those without pedigrees (anyone can claim \"pure bred\" but without a pedigree to back it up - who knows what you are really getting!) or without registered parents! My cats were bred from breeders with multiple generations of their family being breeders and over fifty years combined experience to bring out the best in the breed. Over a dozen champion bloodlines are in all my pets including but not limited to multiple Supreme Grand Champion. $1995 adoption fee for pet homes for females and when they go to their new homes my quality kittens will have; Parental Genetic Testing, Parental Blood Tests and Health Screenings, Veterinarian Health Examination and Veterinarian Health Certification Certificate, and Multiple Current Vaccinations, Multiple Blood Tests, Health Guarantee and it is all in writing! These kittens come from parents with a Genuine multiple generation pedigree, TICA Registration, and more. Previous litters have been Blue Mitted, Blue Lynx, Blue Bicolor, Seal BiColor, Seal Point, Seal Mitted, Colorpoint, Chocolate, Lilac and others. Please TEXT to get the quickest response or call 610-235-six446-no-spam-please or visit my site;\n\nragdollkittensdivine.com\n\n180120", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/mvE2rVH749.jpg", "detail_url": "http://www.hoobly.com/cjoEm/adorea-genuine-ragdoll-female-seal-bicolor-kitten-for-sale-adoption-with-multiple-supreme-grand-champion-bloodlines-tica-pedigreed-purebred.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/PqAjhbDUXZ.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/mvE2rVH749.jpg"]}, {"id": "5gQeE", "title": "TICA registered proven Ragdoll stud (Cocoa)", "desc": "This is my TICA registered Ragdoll, Cocoa. He was born on April 5, 2015. He has produced s", "location": "Athens, Ohio", "posted": "2017-03-08", "updated": "2018-02-24", "breed": "Ragdoll", "price": "$600", "content": "This is my TICA registered Ragdoll, Cocoa. He was born on April 5, 2015. He has produced several litters and they have all been VERY good sized! He definitely produces large litters! He's super lovable and very good with the females.\r\n_________________________________________________\r\nSire: Ragdahl Casenova\r\nDam: Rosesrags Emerald\r\n_________________________________________________\r\nHis stud fee is $600, but I will also consider pick of the litter. (The fee is considered as the price of one kitten which most charge $600+ for one).\r\n_________________________________________________\r\nIf you're interested before I have more information listed then feel free to send me a message with any questions you might have and I'll be happy to answer them to the best of my abilities. 😊", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/QQmhjMnDXZ.jpg", "detail_url": "http://www.hoobly.com/5gQeE/tica-registered-proven-ragdoll-stud.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/7Kb2ahBP20.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/QQmhjMnDXZ.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/TYTLnbaUeg.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/jvKy2ar0t4.jpg"]}, {"id": "TRvMB", "title": "Ragdoll Kittens", "desc": "Ragdoll Kittens, seal mink and blue mink available, $800-900 + tax, first shot, vet checke", "location": "Brownton, Minnesota", "posted": "2018-01-20", "updated": "2018-02-24", "breed": "Ragdoll", "price": "", "content": "Ragdoll Kittens, seal mink and blue mink available, $800-900 + tax, first shot, vet checked, litter box trained, written health guarantee, kitten pack, family raised around 4 young children and 2 dogs, mom & dad are registered with TICA, the kitten price is pet price no papers, if you are looking for papers please call so we can discuss. 320-296-3561 More info, price and pictures on our website www.lakesideragdolls.com", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/ixxUaHqFcC.jpg", "detail_url": "http://www.hoobly.com/TRvMB/ragdoll-kittens.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/5WOoNoJeKO.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/ixxUaHqFcC.jpg"]}, {"id": "GL4jd", "title": "iggy - red tabby solid male ragdoll kitten", "desc": "Visit our website at https://RagdollKitten.us\r\nIggy is a handsome Red Tabby Solid Male Rag", "location": "Wichita Falls, Texas", "posted": "2018-02-24", "updated": "2018-02-24", "breed": "Ragdoll", "price": "$2,000", "content": "Visit our website at RagdollKitten.us\r\nIggy is a handsome Red Tabby Solid Male Ragdoll Kitten. His parents are Esmeralda and Pride and he was born on 1/2/2018 and will be ready to come home on 3/27/2018. Iggy is located in Texas and comes with a one year genetic guarantee (five year genetic guarantee optionally available), a three day all health guarantee, microchipped, dewormed, 30 day flea prevention, and all his kitten vaccinations. Breeding Rights allowing Iggy to not be altered and giving you rights to sell papered kittens produced by him can be purchased for an additional fee shown below.\n\nPet Price: $2,000.00\r\nBreeder Price: $3,000.00", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/9GrlzVTYIb.jpg", "detail_url": "http://www.hoobly.com/GL4jd/iggy-red-tabby-solid-male-ragdoll-kitten.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/9GrlzVTYIb.jpg"]}, {"id": "raXjC", "title": "Adorable Ragdoll Kittens", "desc": "Registered TICA Ragdoll kittens! Laid-back kittens that are raised as part of the family. ", "location": "White Plains, Maryland", "posted": "2017-10-09", "updated": "2018-02-24", "breed": "Ragdoll", "price": "$700", "content": "Registered TICA Ragdoll kittens! Laid-back kittens that are raised as part of the family. Are around other cats and dogs as well. Exceptional quality. Gorgeous blue eyes and soft fur!\n\nCurrently available:\r\nNone - should have kittens soon.\n\nThey come litter trained, first two sets of shots, and de-worming.  All kittens come with a 48 hour health guarantee as well as a 1year genetic health guarantee. Check out casterlyrockrags.com for more info.", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/9KQ8nhXuXr.jpg", "detail_url": "http://www.hoobly.com/raXjC/adorable-ragdoll-kittens-accepting-deposits.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/9KQ8nhXuXr.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/B3n82zAugR.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/ZhtLeXMl6N.jpg"]}, {"id": "UaqEH", "title": "Beautiful Ragdoll Kittens blue seal flame mink and bicolors", "desc": "We have beautiful ragdoll kittens available.  They are very sweet.  They come up to date o", "location": "Maryville, Tennessee", "posted": "2017-09-20", "updated": "2018-02-24", "breed": "Ragdoll", "price": "$950", "content": "We have beautiful ragdoll kittens available.  They are very sweet.  They come up to date on vaccinations and with a 1 yr guarantee.  We have delivery options available.  Delivery is generally $250.  Feel free to text or call with questions. Friend us on facebook aaronvictoryragdolls  or visit our site and see pictures www.victoryragdolls.com\r\nJennifer\r\n865-405-5472\r\nWe have several colors available at this time\r\nRed Flame mink girl ($1050 for her.  They are rare)\r\nSeal lynx tortie mink girl\r\n1 chocolate bicolor girl\r\n1 Red Flame mink boy\r\n1 seal bicolor girl\r\n1 seal tortie girl", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/2nqYlSycfS.jpg", "detail_url": "http://www.hoobly.com/UaqEH/beautiful-ragdoll-kittens-blue-seal-flame-mink-and-bicolors.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/1bzTfZpSHi.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/2nqYlSycfS.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/6o2a0oe76L.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/AxDKTGDEa8.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/DsZIPlMaOg.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/n79SsBfWiY.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/omdTrlx4C5.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/p27IoHngzu.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/vDkV6wNdVn.jpg"]}, {"id": "aKjfp", "title": "Ragdoll Kittens", "desc": "Beautiful Ragdoll kittens.  We have 1 kitten available at this time.  We are a CFA registe", "location": "Monticello, Kentucky", "posted": "2016-11-22", "updated": "2018-02-24", "breed": "Ragdoll", "price": "$800", "content": "Beautiful Ragdoll kittens.  We have 1 kitten available at this time.  We are a CFA registered cattery since 2011.  All our litters are registered.  Kittens is vet checked twice and have their first 2 set of shots.  Check us out on our Facebook Page.  Baby Girl Paws Cattery or our website.  This little baby is a Seal Point Mink female. Beautiful.", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/eGXFVBGqKs.jpg", "detail_url": "http://www.hoobly.com/aKjfp/ragdoll-kittens.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/5l4BQ1zut1.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/eGXFVBGqKs.jpg"]}, {"id": "0VzUk", "title": "Ragdoll Kitten!", "desc": "One gorgeous girl purebred Ragdoll Kitten left born 12-10-17. Mom is a Lynx point, Dad is ", "location": "Loxahatchee, Florida", "posted": "2017-12-18", "updated": "2018-02-24", "breed": "Ragdoll", "price": "$1,500", "content": "One gorgeous girl purebred Ragdoll Kitten left born 12-10-17. Mom is a Lynx point, Dad is a Blue point.\n\n\"Precious\" is a beautiful female Lynx point that knows she's gorgeous. Loves to explore and play. Shes super soft and will cuddle with you in bed. She's ready for her home now! $1500\n\nKittens are all UTD on shots and deworming, they have health certificates from the vet given 2-8-18. \n\nCall or text for more info, texts preferred. 505-258-9383.\n\nLocated in Loxahatchee Florida, visits welcomed!\n\nMore kittens ready around 4-17-18.", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/bNfmeUt6LK.jpg", "detail_url": "http://www.hoobly.com/0VzUk/christmas-ragdoll-kittens.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/2uVtCla26h.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/JUg5jUTFwb.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/KhtW0qYWAa.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/T1bju3ZcxX.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/WfsbUF811k.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/bNfmeUt6LK.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/cB4qugkzuN.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/cFQIRVFMvL.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/jDlyuNs29P.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/obXvexKY40.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/rA2KZMBs6n.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/sGrYN7VCz4.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/sKJISmSYuP.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/vVVx5LH26D.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/y6213PKfj3.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/zS8fwsoSSU.jpg"]}, {"id": "iF6Gh", "title": "******Awesome  Tica registered Ragdoll kittens!!!!!!!!", "desc": "Ragdolls kittens; tabby Girl and Lilac and white bicolor boy! Taking deposit to Reserve ki", "location": "Waterford, Michigan", "posted": "2018-02-24", "updated": "2018-02-24", "breed": "Ragdoll", "price": "$600", "content": "Ragdolls kittens; tabby Girl and Lilac and white bicolor boy! Taking deposit to Reserve kittens until ready to go home with you at 8 weeks old. More pics added weekly. They will be Vet checked healthy, wormed, litter box trained, well socialized and loving when ready to go home with you! Reserve now with Paypal! Link is on my website.\n\nCheck my website; www.ragedyanndolls.jigsy.com/available\r\nCall or text for fastest response. (248) 812-6328", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/zoUNffOci5.jpg", "detail_url": "http://www.hoobly.com/iF6Gh/lilac-and-chocolate-ragdoll-kittens.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/FGKsDYr18Q.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/Z2hIxl58qn.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/su2qvUiOdN.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/ygizzOpdFB.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/zoUNffOci5.jpg"]}, {"id": "Unskw", "title": "Blue Bicolor Solid TICA Ragdoll male with breeding rights", "desc": "He is such a sweet, fluffy boy! And he's a gorgeous RARE color!!\r\nBorn 12/7/17, ready to g", "location": "Salt Lake City, Utah", "posted": "2018-01-25", "updated": "2018-02-24", "breed": "Ragdoll", "price": "$2,400", "content": "He is such a sweet, fluffy boy! And he's a gorgeous RARE color!!\r\nBorn 12/7/17, ready to go to his new home the first week of March 2018.\n\nLoki- Seal Mitted Mink (carries dilute) is his Sire,\n\nJosie- Black Tortie Bicolor Solid (carries dilute and colorpoint) is his Queen\n\nPrice includes;\n\n-Breeding rights for approved TICA registered catteries\r\n-Up to date on FVRCP + Feline Chlamydia vaccines (2-3 rounds depending on age)\r\n-Dewormed plus giardia prevention\r\n-72 hour overall health guarantee\r\n-1 year genetic health guarantee\r\n-HCM, PKD, MPS VI - free (UC Davis tested)\r\n-Vet examined + clean bill of health provided\n\nShipping is $350.\n\nVisit our website for more info: RemarkableRagdolls.com", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/MINhb1a9RP.jpg", "detail_url": "http://www.hoobly.com/Unskw/blue-bicolor-solid-male-tica-registered-ragdoll.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/7mAkZuSbWR.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/K1OFaboTHn.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/MINhb1a9RP.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/dc2kkitLdr.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/p68okfF1Dc.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/qLsyZBWuLQ.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/r5Nt4erV4T.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/zfxFztV3yJ.jpg"]}, {"id": "bvTxY", "title": "Black Bicolor Solid TICA Ragdoll male with breeding rights", "desc": "Born 12/7/17, ready to go to his new home the first week of March 2018. He is going to be ", "location": "Salt Lake City, Utah", "posted": "2018-01-08", "updated": "2018-02-24", "breed": "Ragdoll", "price": "$2,400", "content": "Born 12/7/17, ready to go to his new home the first week of March 2018. He is going to be a BIG boy!\n\nLoki- Seal Mitted Mink (carries dilute) is his Sire,\n\nJosie- Black Tortie Bicolor Solid (carries dilute and colorpoint) is his Queen\n\nPrice includes;\n\n-Breeding rights for approved TICA registered catteries\r\n-Up to date on FVRCP + Feline Chlamydia vaccines (2-3 rounds depending on age)\r\n-Dewormed plus giardia prevention\r\n-72 hour overall health guarantee\r\n-1 year genetic health guarantee\r\n-HCM, PKD, MPS VI - free (UC Davis tested)\r\n-Vet examined + clean bill of health provided\n\nShipping is $350.\n\nVisit our website for more info: RemarkableRagdolls.com", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/JBbXVcB5Hq.jpg", "detail_url": "http://www.hoobly.com/bvTxY/gorgeous-tica-reg-purebred-solid-ragdoll-kittens-males-left.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/BTxaSSDt6S.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/CnMgZC0ReA.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/HMAeWLA2em.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/JBbXVcB5Hq.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/We8WRR3sUg.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/YfTJ5gJwOM.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/dwI04uRjbj.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/gHpdXGE2I2.jpg"]}, {"id": "ryNr2", "title": "CH bloodlines - Male Ragdoll stud for sale - TICA Registered.", "desc": "Stackhouse has sired 6 litters now and we are holding back some of his females for our bre", "location": "Salt Lake City, Utah", "posted": "2018-01-12", "updated": "2018-02-24", "breed": "Ragdoll", "price": "$2,000", "content": "Stackhouse has sired 6 litters now and we are holding back some of his females for our breeding program. Our new male is now old enough to breed so we are looking for a good home for him as a breeder. He is a year and a half old , BLUE EYED, Seal Mitted Mink that carries Dilute.  He has an excellent head shape and very good build, with a medium length coat that is very plush, and rich, dark brown in color. He is 10 lbs, but he still has 2-3 years of growing left. UC Davis tested and negative for HCM, PKD, MPS VI.  We are a FeLV and FIV free cattery.\n\nBreeder price dropped to - $2000\n\nShipping is $350\n\nRemarkableRagdolls.com", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/TSRBJqZ5Gb.jpg", "detail_url": "http://www.hoobly.com/ryNr2/yr-old-male-stud-for-sale-tica-ragdoll.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/TSRBJqZ5Gb.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/XEpmH176GI.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/aDkUqSuTnQ.jpg"]}, {"id": "iZVuN", "title": "Ragdoll kittens ready to go soon", "desc": "Hello I have 1 male  and 2 femail ragdoll kittens available, they are ready to go by March", "location": "Denver, Pennsylvania", "posted": "2018-02-24", "updated": "2018-02-24", "breed": "Ragdoll", "price": "$895", "content": "Hello I have 1 male  and 2 femail ragdoll kittens available, they are ready to go by March 12th , they're sweet and affectionate, happy and very playful , and have great temperaments, the kittens are raised, socialized and loved from day one in our home , living among our children and family , all kittens will come with a health guarantee and up to date on shots and wormers . they are named male Mason, females are Maggie and Mandy , they all have nice blue eyes ,\r\nA $100.00 down payment's will hold them just for you\r\nFor more information please text/call Katie @ 717-682-8207\n\nIf you like to email me, you may use this email Email Me Here", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/9uE1TTUmKl.jpg", "detail_url": "http://www.hoobly.com/iZVuN/ragdoll-kittens-ready-to-go-soon.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/3Eg99erMHO.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/4wkCEiEEY8.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/5RdpIkVo2I.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/9uE1TTUmKl.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/Ae2KfEfeSL.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/CUsLWfUnhd.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/GE4l3b3cfT.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/S30dXALbyv.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/Vj31dfXgas.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/ZX61ONqNBB.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/b72Ofrk7sO.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/cnep58iSR9.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/hD8eKuhEnQ.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/oqI0crgcXK.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/pW6TCJJtMc.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/sxxcH5mewE.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/xAYJpT2HrZ.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/xyVek1xTRG.jpg"]}, {"id": "eDcFG", "title": "Ragdolls Coming Feb 28th!", "desc": "I have a litter of Ragdolls coming February 28th and should be ready to go to their foreve", "location": "Hamburg, New York", "posted": "2018-02-05", "updated": "2018-02-24", "breed": "Ragdoll", "price": "$400", "content": "I have a litter of Ragdolls coming February 28th and should be ready to go to their forever homes at the end of April. Prices start at $400. Rare sepia's are possible and will be more money depending on markings. All kittens will have 1st shots, worming, vet check and health cert. Before leaving. I would prefer they go to indoor homes. I am also expecting a litter of persian/ragdoll mid march and those should be spectacular!  ❤ I am also expecting Sepia's in that litter as well as the mom is a chocolate persian and the fathers' father was a sepia..  The CHOCOLATE PERSIAN (not grey) is the one expecting in march...Chocolate persian kittens due in march will be between $550 -$650 depending on color. Mom ragdoll is a Lilac point...dad is a chocolate point...", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/R6rGuh2qgd.jpg", "detail_url": "http://www.hoobly.com/eDcFG/ragdolls-coming-feb-th.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/EwRLIegvLh.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/R6rGuh2qgd.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/nXcGw0v10S.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/ntvLABXjPU.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/pjKXdaZj9n.jpg"]}, {"id": "N3zcV", "title": "Ragdoll Kittens", "desc": "Nova and Smudges are expecting kittens on March 22. If you are interested I can be reached", "location": "Olive Branch, Mississippi", "posted": "2018-02-24", "updated": "2018-02-24", "breed": "Ragdoll", "price": "$950", "content": "Nova and Smudges are expecting kittens on March 22. If you are interested I can be reached @ 901-334-8965 and my email address Email Me Here\n\nThanks,\n\nTerri Hester", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/gbQ8mrO8TW.jpg", "detail_url": "http://www.hoobly.com/N3zcV/ragdoll-kittens.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/gbQ8mrO8TW.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/mFdLRsNfCC.jpg"]}, {"id": "DnYjG", "title": "Tica registered Ragdoll Kittens 1 left", "desc": "female blue point left \r\n\r\nAccepting deposits on upcoming litters \r\n\r\nKittens leave with t", "location": "Center Line, Michigan", "posted": "2017-05-07", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$1,200", "content": "female blue point left\n\nAccepting deposits on upcoming litters\n\nKittens leave with the following\n\nVeterinarian Check\n\nAge Appropriate Vaccines\n\nDe worming\n\nSpay/ Neuter\n\nRegistration Papers\n\nKitten Kit\n\ninsurance\n\ngenetic health guarantee", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/7yKpPNxfX4.jpg", "detail_url": "http://www.hoobly.com/DnYjG/tica-registered-ragdoll-kittens.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/7yKpPNxfX4.jpg"]}, {"id": "5GqIl", "title": "Tica Registered Kittens Available - 1 left", "desc": "Accepting deposits on upcoming litters \r\n\r\nKittens leave with the following\r\n\r\nVeterinaria", "location": "Detroit, Michigan", "posted": "2017-05-07", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$1,200", "content": "Accepting deposits on upcoming litters\n\nKittens leave with the following\n\nVeterinarian Check\n\nAge Appropriate Vaccines\n\nDe worming\n\nSpay/ Neuter\n\nRegistration Papers\n\nHealth Guarantee\n\nLife time support\n\n6 weeks insurance", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/7yKpPNxfX4.jpg", "detail_url": "http://www.hoobly.com/5GqIl/tica-registered-kitten-available-available.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/7yKpPNxfX4.jpg"]}, {"id": "WKG8a", "title": "Do you Love Maine Coons AND Ragdolls? How about a New Breed that Combines the Colors and Best Qualities of Both", "desc": "Kittens are a newer breed called Legend Cats (Previously Legend Lynx). The breed is simila", "location": "Tampa, Florida", "posted": "2018-01-31", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$245", "content": "Kittens are a newer breed called Legend Cats (Previously Legend Lynx). The breed is similar to Maine Coons and Ragdolls. Our Colorpoints all have blue eyes. We also have Marbles, tabbies and a few solids in Maine Coon colors available.\n\nThese kittens are playful, extra smart kittens. This newer breed is similar to and descended predominantly from Maine Coons and Angora types such as Siberians and Turkish Angoras with Ragdoll type cats mixed in the gene pool. People often ask if my Color Points are Ragdolls, but their facial features are actually more like Maine Coons. They come in traditional Maine Coon colors as well as Ragdoll colors. If you would like to read more on our website, please let me know and I will send you links. We have not updated kitten photos in several years, but you can see photos of grandparents and some of the parents at this site.\r\nThese cats will have long hair like Maine Coons and Ragdolls and their personalities have all the same great qualities. In addition, they will come when called and are extra affectionate. Males may have larger faces and bulkier bodies than Maine Coons. These cats are extremely smart and have wonderful personalities. Males and many of the females are wonderful lap cats.\n\nPlease note that I am unable to text photos or send them from this site. You will need to send me your email address to receive photos.\n\nWe will have new litters available soon.\n\nKittens from the new litters will start becoming available in late February. We normally take photos of kittens when they are about 4 weeks old and are getting fluffy and you can begin to tell what they are going to look like. Here are approximate dates that photos will be available for each litter: Litter 1 January 17. Litter 2- 7th of February, Litter 3 Mid February. Pics of previous litters can be seen at www.hoobly.com/gdYtE/do-you-love-maine-coons-and-ragdolls-how-about-a-new-breed-that-combines-the-colors-and-best-qualities-of-both.htm\r\nand at www.wildfacescattery.com and at surgewebdesign.us/legendcat/ .\n\nOur kittens are known for their wonderful personalities, their close bond with, love for, and interaction with their owners so we know you won't have a chance to be lonely with one of our kittens. Our kittens are litter box trained at 4 weeks old so you never have to worry. Kittens come wormed and treated with Revolution to prevent heartworm and ear mites.\n\nWe just had 3 new litters that will be available to show starting mid February and are currently taking deposits. The first litter will be ready to go starting March 1.\n\nLitter 1 will be a black polydactyl that has extra toes front and back and will have huge paws for $245 and 2 black and whites, a female with white paws and bib for $339 and a male that is polydactyl with a white stripe down the face and huge white paws for $395. There is also a gorgeous black tortie female with orange at the outside of each eye for $395. Pics below.\n\nLitter 2 will be ready around the 1st week of march and consists of 4 extremely fluffy and very long haired Color Points which can include Seal Points, Blue Points, White Cream Points, and Lilac Points. Color Points are not priced yet, but normally range between $495 and $575.\n\nLitter 3 will be ready around mid March and consists of a male Orange Marble Tabby with a white feet and a little white on face for $369, a female dark tabby/tortie, a calico, a Black and Silver Tabby male for $495 and a Color Point. Some of these kittens are too young to price as their markings are not as visible yet.  Most of this litter is polydactyl (extra toes) see Hemingway Cats.\n\nLitter 4 will be available around April 1 and consists of  a calico female for around $289, a silver tabby for around $395 and a Colorpoint for around $435 and more.\r\nWe expect to have one or two regular toe black kittens in May reduced for summer for $175.\n\nFor other kittens that haven't been priced yet,\n\n*White Cream Points generally run between $399 and $469\r\n*Torties can start as low as $195\r\n*Calicos can start as low as $289\r\nDark Tabby Marbles generally run between $425 and $495\r\nSeal Points usually run between $425 and $575\r\nLilac Points usually run between $425 and $569\r\nBlue Points usually run between $425 and $550\r\nOrange Tabbies usually run between $389 and $469.\r\nPrices may change as supply and demand change and are good for 48 hours.\r\nThank you, Lily\r\nPics below of Litter 1 and largest kitten in Litter 2\n\nPlease email me for additional information or if you would like to see any that are ready-to-go you can text me at 386-385-6387. I can show ready-to-go kittens Saturday evening and Sunday after 11am. Weekdays are Monday through Thursday from 1pm to 7pm and Fridays from 2pm to 5pm.\n\nLet me know if you would like any additional information. Please call me at the number above if you would like to speak with me directly.", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/fWQcjJmpOl.jpg", "detail_url": "http://www.hoobly.com/WKG8a/do-you-love-maine-coons-and-ragdolls-how-about-a-new-breed-that-combines-the-colors-and-best-qualities-of-both.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/5h6UNIlYnd.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/BvqXt2sHV3.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/JZgLrg3LUt.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/LKf5uxsuZs.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/MLYcRpDcmh.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/Odwt551FLf.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/TVIHKlacLq.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/X6xY4KZGZ9.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/XBiMwd6gvk.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/XxFShIyeO9.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/aiZBTBxzys.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/f0l3x3rRdW.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/fWQcjJmpOl.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/k3ZJ1TnNuo.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/kCRomhiCuC.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/z1nKWaryl9.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/zZiQzc2Ol9.jpg"]}, {"id": "gdYtE", "title": "Do you Love Maine Coons AND Ragdolls? How about a New Breed that Combines the Colors and Best Qualities of Both", "desc": "These cats will have long hair like Maine Coons and Ragdolls and their personalities have ", "location": "Tampa, Florida", "posted": "2017-12-06", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$239", "content": "These cats will have long hair like Maine Coons and Ragdolls and their personalities have all the same great qualities. In addition, they will come when called and are extra affectionate. Males may have larger faces and bulkier bodies than Maine Coons. These cats are extremely smart and have wonderful personalities. Males and many of the females are wonderful lap cats.\r\nPlease send me your current email address for pics and further information.\n\nPlease note that I am unable to text photos or send them from this site. You will need to send me your email address to receive photos.\n\nWe are currently sold out until late February. We normally take photos of kittens when they are about 4 weeks old and are getting fluffy and you can begin to tell what they are going to look like. We start taking deposits about that time also. Here are approximate dates that photos will be available (& deposits taken) for each litter: Litter 1 last few days of January. Litter 2- 2nd week of February, Litter 3 Mid February.\n\nWe frequently have the following colors in Color Point kittens: Flame Points, Cream Points, Seal Points, Blue Points, Lilac Points, Lynx Point Marbles and Seal Minks. Color Points prices generally start at $435.\n\nIn Maine Coon colors, Black or Black mix colors generally start at $239. Black and whites are generally $350 and up. Tabbies and marbles usually start at $439.\n\nWhite Cream Point males are generally priced from $435 to $550. Watch these Whiskas commercials featuring our kittens. Our kittens from our cattery are the White at the start of Ep 2 and the two kissing Seal Points. They are also featured in Episodes 1 & 3.", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/f0l3x3rRdW.jpg", "detail_url": "http://www.hoobly.com/gdYtE/do-you-love-maine-coons-and-ragdolls-how-about-a-new-breed-that-combines-the-colors-and-best-qualities-of-both.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/5h6UNIlYnd.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/BvqXt2sHV3.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/JZgLrg3LUt.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/LKf5uxsuZs.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/MLYcRpDcmh.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/Odwt551FLf.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/TVIHKlacLq.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/X6xY4KZGZ9.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/XBiMwd6gvk.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/XxFShIyeO9.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/aiZBTBxzys.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/f0l3x3rRdW.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/k3ZJ1TnNuo.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/kCRomhiCuC.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/z1nKWaryl9.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/zZiQzc2Ol9.jpg"]}, {"id": "cIMnZ", "title": "Purebred Pedigreed Kittens.  Best of Maine Coons and Ragdolls. New Litters & Photos.  Great Personalities!", "desc": "Purebred Pedigreed Legend Cat Colorpoint Kittens. Many of them look very much like Ragdoll", "location": "Tampa, Florida", "posted": "2017-07-30", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$239", "content": "Purebred Pedigreed Legend Cat Colorpoint Kittens. Many of them look very much like Ragdolls or Maine Coons. Pedigree papers and health certificate available. Extremely friendly and loving with dog-like personalities. Will come when called. Very intelligent! Good with children and pets.\n\nPlease note that I am unable to text photos or send them from this site. You will need to send me your email address to receive photos.\n\nWe are currently sold out until late February. We normally take photos of kittens when they are about 4 weeks old and are getting fluffy and you can begin to tell what they are going to look like. We start taking deposits about that time also. Here are approximate dates that photos will be available (& deposits taken) for each litter: Litter 1 last few days of January. Litter 2- 2nd week of February, Litter 3 Mid February.\n\nWe frequently have the following colors in Color Point kittens: Flame Points, Cream Points, Seal Points, Blue Points, Lilac Points, Lynx Point Marbles and Seal Minks. Color Points prices generally start at $435.\n\nIn Maine Coon colors, Black or Black mix colors generally start at $239. Black and whites are generally $350 and up. Tabbies and marbles usually start at $439.\n\nWhite Cream Point males are generally priced from $435 to $550.  Watch these Whiskas commercials featuring our kittens. Our kittens from our cattery are the White at the start of Ep 2 and the two kissing Seal Points. They are also featured in Episodes 1 & 3.\n\nwww.youtube.com/watch?v=vzNcqZ4CUJE\r\n.", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/BvqXt2sHV3.jpg", "detail_url": "http://www.hoobly.com/cIMnZ/purebred-pedigreed-legend-cat-kittens-extremely-intelligent-and-friendly-ragdoll-look-blue-eyes.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/5h6UNIlYnd.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/BvqXt2sHV3.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/JSQeDyLZhA.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/JZgLrg3LUt.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/LKf5uxsuZs.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/MLYcRpDcmh.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/Odwt551FLf.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/TVIHKlacLq.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/X6xY4KZGZ9.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/XBiMwd6gvk.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/XxFShIyeO9.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/aiZBTBxzys.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/f0l3x3rRdW.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/fWQcjJmpOl.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/k3ZJ1TnNuo.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/kCRomhiCuC.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/pt77XaopDq.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/z1nKWaryl9.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/zZiQzc2Ol9.jpg"]}, {"id": "ERrst", "title": "*Rambunctious Ragdoll Kittens*", "desc": "We have 4 gorgeous purebred Ragdoll kittens available-2 males & 2 females.\r\nIt looks like ", "location": "Palm Coast, Florida", "posted": "2018-02-16", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$900", "content": "We have 4 gorgeous purebred Ragdoll kittens available-2 males & 2 females.\r\nIt looks like 3 will be seal points & 1 seal bicolor. Still too early to tell.\r\nKittens are home raised & spoiled rotten.\n\nPrice is $900/ kitten PET PRICE. A discount will be given on a second kitten purchased.\r\nDeposit of $150 will hold the kitten of your choice & will go towards full purchase price.\r\nThey will have first set of vaccinations, FL health certs, be litter trained, TICA registered, wormed & pre-spoiled.\r\nFirst come, first served.\n\nThese babies go fast!!\r\nWe have many references from many happy kitty customers. :)\r\nPlease message for more info.\r\nThanks!!", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/4CVPdy8dc8.jpg", "detail_url": "http://www.hoobly.com/ERrst/rambunctious-ragdoll-kittens.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/4CVPdy8dc8.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/KqZooSh2mp.jpg"]}, {"id": "aeD1c", "title": "\"Carly\" is a beautiful Seal Point Female Ragdoll Kitten tica registered felv/fiv/hw negative fully vetted all worming and vaccines are current florida health certificate hcm tested", "desc": "\"Carly\" is a gorgeous TICA Registered Seal Point Female Ragdoll Kitten. She comes from a m", "location": "Port Orange, Florida", "posted": "2018-02-23", "updated": "2018-02-24", "breed": "Ragdoll", "price": "", "content": "\"Carly\" is a gorgeous TICA Registered Seal Point Female Ragdoll Kitten. She comes from a multiple Champion Bloodline. SHIPPING IS AVAILABLE. She was born on 02-02-2018 and should be ready approximately April 25th 2018. She is available for making a deposit for adoption and will be ready to go to her new loving home in April 2018. You may purchase her as a breeder, with full breeding rights ( not neutered ). Or as a pet, no breeding rights ( neutered). She is FeLV/FIV/HW Neg. And also Negative for HCM and PKD. We use Davis Labs for DNA testing. She will be leaving us with a Certified Florida Health Certificate and a one year Genetic Health Guarantee. Our contract and guarantee are in writing to protect you and your new kitten. We are a very small registered TICA Cattery. All of our Queens and King Live with us in our home, with Lots of Love. If you have any questions please send us a message, or visit our secure website; www.dixieragdolls.com We have 2 new litter's to choose from!!  *******Carly is Sold ******\ndixieragdolls.com or Please text us, for a faster response. 321-383-Four 808", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/hGFkWwvJke.jpg", "detail_url": "http://www.hoobly.com/aeD1c/carly-is-a-beautiful-seal-point-female-ragdoll-kitten-tica-registered-felv-fiv-hw-negative-fully-vetted-all-worming-and-vaccines-are-current-florida-health-certificate-hcm-tested.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/hGFkWwvJke.jpg"]}, {"id": "E5dPJ", "title": "\"Cody\" is a beautiful black solid mitted tuxedo with a blaze male ragdoll kitten tica registered felv/fiv/hw negative fully vetted all worming and vaccines are current florida health certificate hcm t", "desc": "\"Cody\" is a gorgeous TICA Registered Black Solid Mitted with a Blaze male Ragdoll Kitten. ", "location": "Port Orange, Florida", "posted": "2018-02-23", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$1,995", "content": "\"Cody\" is a gorgeous TICA Registered Black Solid Mitted with a Blaze male Ragdoll Kitten. He comes from a multiple Champion Bloodline. SHIPPING IS AVAILABLE. He was born on 02-02-2018 and should be ready approximately April 25th 2018. He is available for making a deposit for adoption and will be ready to go to his new loving home in April 2018. You may purchase him as a breeder, with full breeding rights ( not neutered ). Or as a pet, no breeding rights ( neutered). He is FeLV/FIV/HW Neg. And also Negative for HCM and PKD. We use Davis Labs for DNA testing. He will be leaving us with a Certified Florida Health Certificate and a one year Genetic Health Guarantee. Our contract and guarantee are in writing to protect you and your new kitten. We are a very small registered TICA Cattery. All of our Queens and King Live with us in our home, with Lots of Love. If you have any questions please send us a message, or visit our secure website; www.dixieragdolls.com We have 2 new litter's to choose from!!\ndixieragdolls.com or Please text us, for a faster response. 321-383-Four 808", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/SfhCJ1mKVP.jpg", "detail_url": "http://www.hoobly.com/E5dPJ/cody-is-a-beautiful-black-solid-mitted-tuxedo-with-a-blaze-male-ragdoll-kitten-tica-registered-felv-fiv-hw-negative-fully-vetted-all-worming-and-vaccines-are-current-florida-health-certificate-hcm-t.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/SfhCJ1mKVP.jpg"]}, {"id": "wHx7l", "title": "\"Carrie\" is a beautiful Seal Mitted Mink  Female Ragdoll Kitten tica registered felv/fiv/hw negative fully vetted all worming and vaccines are current florida health certificate hcm tested", "desc": "\"Carrie\" is a gorgeous TICA Registered Seal Mitted Mink Female Ragdoll Kitten. She comes f", "location": "Port Orange, Florida", "posted": "2018-02-23", "updated": "2018-02-24", "breed": "Ragdoll", "price": "", "content": "\"Carrie\" is a gorgeous TICA Registered Seal Mitted Mink Female Ragdoll Kitten. She comes from a multiple Champion Bloodline. SHIPPING IS AVAILABLE. She was born on 02-02-2018 and should be ready approximately April 25th 2018. She is available for making a deposit for adoption and will be ready to go to her new loving home in April 2018. You may purchase her as a breeder, with full breeding rights ( not neutered ). Or as a pet, no breeding rights ( neutered). She is FeLV/FIV/HW Neg. And also Negative for HCM and PKD. We use Davis Labs for DNA testing. She will be leaving us with a Certified Florida Health Certificate and a one year Genetic Health Guarantee. Our contract and guarantee are in writing to protect you and your new kitten. We are a very small registered TICA Cattery. All of our Queens and King Live with us in our home, with Lots of Love. If you have any questions please send us a message, or visit our secure website; www.dixieragdolls.com We have 2 new litter's to choose from!! *****Carrie is SOLD *******\ndixieragdolls.com or Please text us, for a faster response. 321-383-Four 808", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/FvaRNTU2Kq.jpg", "detail_url": "http://www.hoobly.com/wHx7l/carrie-is-a-beautiful-seal-mitted-mink-female-ragdoll-kitten-tica-registered-felv-fiv-hw-negative-fully-vetted-all-worming-and-vaccines-are-current-florida-health-certificate-hcm-tested.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/FvaRNTU2Kq.jpg"]}, {"id": "QBsJe", "title": "\"Bear\" is a beautiful Blue Mink Mitted Male Ragdoll Kitten tica registered felv/fiv/hw negative fully vetted all worming and vaccines are current florida health certificate hcm tested", "desc": "\"Bear\" is a gorgeous TICA Registered Blue Mink Mitted Male Ragdoll Kitten. He comes from a", "location": "Port Orange, Florida", "posted": "2018-02-23", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$1,995", "content": "\"Bear\" is a gorgeous TICA Registered Blue Mink Mitted Male Ragdoll Kitten. He comes from a multiple Champion Bloodline. SHIPPING IS AVAILABLE. He was born on 01-26-2018 and should be ready approximately April 20th 2018. He is available for making a deposit for adoption and will be ready to go to his new loving home in April 2018. You may purchase him as a breeder, with full breeding rights ( not neutered ). Or as a pet, no breeding rights ( neutered). He is FeLV/FIV/HW Neg. And also Negative for HCM and PKD. We use Davis Labs for DNA testing. He will be leaving us with a Certified Florida Health Certificate and a one year Genetic Health Guarantee. Our contract and guarantee are in writing to protect you and your new kitten. We are a very small registered TICA Cattery. All of our Queens and King Live with us in our home, with Lots of Love. If you have any questions please send us a message, or visit our secure website; www.dixieragdolls.com We have 2 new litter's to choose from!!\ndixieragdolls.com or Please text us, for a faster response. 321-383-Four 808", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/SJk6FQsZpY.jpg", "detail_url": "http://www.hoobly.com/QBsJe/bear-is-a-beautiful-blue-mink-mitted-male-ragdoll-kitten-tica-registered-felv-fiv-hw-negative-fully-vetted-all-worming-and-vaccines-are-current-florida-health-certificate-hcm-tested.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/SJk6FQsZpY.jpg"]}, {"id": "oR8yW", "title": "\"Bentley\" is a beautiful Blue Point Male Ragdoll Kitten tica registered felv/fiv/hw negative fully vetted all worming and vaccines are current florida health certificate hcm tested", "desc": "\"Bently\" is a gorgeous TICA Registered Blue Point male Ragdoll Kitten. He comes from a mul", "location": "Port Orange, Florida", "posted": "2018-02-23", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$1,995", "content": "\"Bently\" is a gorgeous TICA Registered Blue Point male Ragdoll Kitten. He comes from a multiple Champion Bloodline. SHIPPING IS AVAILABLE. He was born on 01-26-2018 and should be ready approximately April 20th 2018. He is available for making a deposit for adoption and will be ready to go to his new loving home in April 2018. You may purchase him as a breeder, with full breeding rights ( not neutered ). Or as a pet, no breeding rights ( neutered). He is FeLV/FIV/HW Neg. And also Negative for HCM and PKD. We use Davis Labs for DNA testing. He will be leaving us with a Certified Florida Health Certificate and a one year Genetic Health Guarantee. Our contract and guarantee are in writing to protect you and your new kitten. We are a very small registered TICA Cattery. All of our Queens and King Live with us in our home, with Lots of Love. If you have any questions please send us a message, or visit our secure website; www.dixieragdolls.com We have 2 new litter's to choose from!!\ndixieragdolls.com or Please text us, for a faster response. 321-383-Four 808", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/9m1XsH0AH4.jpg", "detail_url": "http://www.hoobly.com/oR8yW/bentley-is-a-beautiful-blue-point-male-ragdoll-kitten-tica-registered-felv-fiv-hw-negative-fully-vetted-all-worming-and-vaccines-are-current-florida-health-certificate-hcm-tested.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/9m1XsH0AH4.jpg"]}, {"id": "CIbWR", "title": "\"Binky\" is a beautiful solid Blue Mitted Female Ragdoll Kitten tica registered felv/fiv/hw negative fully vetted all worming and vaccines are current florida health certificate hcm tested", "desc": "\"Binky\"  is a gorgeous TICA Registered Solid Blue Mitted Female Ragdoll Kitten. She comes ", "location": "Port Orange, Florida", "posted": "2017-11-04", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$2,400", "content": "\"Binky\"  is a gorgeous TICA Registered Solid Blue Mitted Female Ragdoll Kitten. She comes from a  multiple Champion Bloodline. SHIPPING IS AVAILABLE.  She was born on 01-26-2018 and should be ready approximately April 20th 2018.  She is available for  making a deposit for adoption and will be ready to go to her new loving home in April 2018. You may purchase her as a breeder, with full breeding rights ( not neutered ). Or as a pet, no breeding rights ( neutered). He is FeLV/FIV/HW Neg. And also Negative for HCM and PKD. We use Davis Labs for DNA testing. She will be leaving us with a Certified Florida Health Certificate and a one year Genetic Health Guarantee. Our contract and guarantee are in writing to protect you and your new kitten. We are a very small registered TICA Cattery. All of our Queens and King Live with us in our home, with Lots of Love.  If you have any questions please send us a message, or visit our secure website; www.dixieragdolls.com  We  have 2 new litter's to choose from!!\ndixieragdolls.com  or Please text us, for a faster response. 321-383-Four 808", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/tUbDQJ21Cw.jpg", "detail_url": "http://www.hoobly.com/CIbWR/blake-is-a-beautiful-blue-pointed-male-ragdoll-tica-registered-felv-fiv-hw-negative-fully-vetted-all-worming-and-vaccines-are-current-florida-health-certificate-hcm-tested.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/tUbDQJ21Cw.jpg"]}, {"id": "RAOhL", "title": "Ragdoll kittens available in Tuscaloosa AL - www.genotypecats.com", "desc": "Genotype Cats has MANY amazingly gorgeous kittens available and up-coming in seal, blue, l", "location": "Tuscaloosa, Alabama", "posted": "2017-07-02", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$1,000", "content": "Genotype Cats has MANY amazingly gorgeous kittens available and up-coming in seal, blue, lilac, flame, cream, tortie in mitted and bicolor with and without lynx, and a blue eyed white male. Prices start at $1000. A $200 non-refundable deposit is required to reserve one of the babies.\n\nThe kittens will be available to go home at 12 weeks at the earliest and will be vaccinated while they are with me but they will require their final vaccinations once in your home. The kittens are sold as limited registration through TICA (spay/neuter contract requires proof of kitten's alter prior to receipt of registration paperwork), any buyer interested in full registration (with breeding rights) should mention this in our initial conversation. There will be an additional fee for full registration.\n\nThe kittens will receive a bill of good health from my veterinarian prior to heading to their new homes and a vet visit is required within 72 hours of when you pick-up your kitten (proof of the visit is required). We do provide a health warranty for full refund within 72 hours if your vet deems the kitten unsuitable for sale (with documentation required from your vet and potentially a second opinion from mine). Our health guarantee supports our belief that we are producing healthy off-spring and that we want to know if any of our kittens show signs of genetically related issues. Thus, if your kitten or cat is diagnosed with a serious genetic defect or congenital disease before 2 years of age we will provide a replacement kitten and work with you to determine the best option for the sick kitten or cat. The types of conditions that would be included as a genetic defect of congenital disease would be life-threatening heart conditions and degenerative nerve disorders (in other words, conditions that effect longevity or quality of life; allergies and innocent heart murmurs do not fall into this category).\n\nPhotos are of some of the available kittens!\n\nGenotype Cats\nwww.facebook.com/genotypecats\n\nwww.genotypecats.com\n\nwww.tranquillhedgies.com\nwww.paradigmpups.com", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/2cVr7Y8Sku.jpg", "detail_url": "http://www.hoobly.com/RAOhL/ragdoll-kittens-in-tuscaloosa-al-www-facebook-com-genotypecats.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/2cVr7Y8Sku.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/42gWkpYE55.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/5OMTC6hLwH.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/FIlbMrzMOv.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/N83aPSJNYB.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/O4gfcR1bRo.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/RxcDAszrRS.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/gpBMXB08Pj.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/uE5fHXWoNp.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/wj0iroMDMQ.jpg"]}, {"id": "HLYvY", "title": "Purebred Ragdoll Male", "desc": "Purebred Ragdoll male.  Declawed and neutered.", "location": "Knoxville, Tennessee", "posted": "2018-02-23", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$100", "content": "Purebred Ragdoll male.  Declawed and neutered.", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/PdU3hATHnb.jpg", "detail_url": "http://www.hoobly.com/HLYvY/purebred-ragdoll-male.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/LM8UKdg05q.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/PdU3hATHnb.jpg"]}, {"id": "gHvti", "title": "Beautiful Ragdoll Kittens blue seal flame mink and bicolors", "desc": "We have beautiful ragdoll kittens available.  They are very sweet.  They come up to date o", "location": "Orlando, Florida", "posted": "2017-09-21", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$950", "content": "We have beautiful ragdoll kittens available.  They are very sweet.  They come up to date on vaccinations and with a 1 yr guarantee.  We have delivery options available.  Delivery is generally $250.  Feel free to text or call with questions. Friend us on facebook aaronvictoryragdolls  or visit our site and see pictures www.victoryragdolls.com\r\nJennifer\r\n865-405-5472\r\nWe have several colors available at this time\r\nSeal mink tortie girl ($1050 for her)\r\n3 Seal tortie bicolor girls\r\n2 Red Flame mink boys", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/2nqYlSycfS.jpg", "detail_url": "http://www.hoobly.com/gHvti/beautiful-ragdoll-kittens-blue-seal-flame-mink-and-bicolors.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/1bzTfZpSHi.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/2nqYlSycfS.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/AGyqLrHMug.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/DsZIPlMaOg.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/HiXoCoxoeC.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/PemgfYsDBT.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/g6xrBjnsOx.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/n79SsBfWiY.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/omdTrlx4C5.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/p27IoHngzu.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/vDkV6wNdVn.jpg"]}, {"id": "iQmog", "title": "Beautiful and playful Female Ragdoll Kitten", "desc": "I have a playful and beautiful Female Ragdoll kitten, ready for home in 1 week. Well taken", "location": "Miami, Florida", "posted": "2018-02-10", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$500", "content": "I have a playful and beautiful Female Ragdoll kitten, ready for home in 1 week. Well taken care of and raised around cats and dogs, looking for a home of a loving owner as She is a sweet and loving kitten. Please contact for further info, serious inquiries please as she will be ready for a home in a week. Yes we will travel and meet if needed, Thank you", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/TphDx7eBNa.jpg", "detail_url": "http://www.hoobly.com/iQmog/beautiful-and-playful-female-ragdoll-kitten.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/8GeaQrxntA.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/TphDx7eBNa.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/TwPorD4sIr.jpg"]}, {"id": "wW6GZ", "title": "Rose Genuine Ragdoll Female Seal Bicolor Kitten For Sale Adoption With Multiple Supreme Grand Champion Bloodlines TICA Pedigreed Purebred", "desc": "Genuine female bicolor Multiple Generation TICA Pedigreed Purebred Ragdoll Kitten raised w", "location": "Haines City, Florida", "posted": "2018-01-21", "updated": "2018-02-23", "breed": "Ragdoll", "price": "", "content": "Genuine female bicolor Multiple Generation TICA Pedigreed Purebred Ragdoll Kitten raised with my five children and with my other cats with multiple Supreme Grand Champion Bloodlines and a dozen plus more awards and my dogs (dog and children friendly!) Suburban home hobby bred and raised with my five young children ages eight through seventeen. Excellent dispositions and unequaled temperaments; I can't stress enough how great it is that my Genuine Ragdoll Cats and Kittens are well socialized with my multiple children and other pets. My family raises top quality true TICA Ragdoll Cats and kittens - beware of the fakes - those without pedigrees (anyone can claim \"pure bred\" but without a pedigree to back it up - who knows what you are really getting!) or without registered parents! My cats were bred from breeders with multiple generations of their family being breeders and over fifty years combined experience to bring out the best in the breed. Over a dozen champion bloodlines are in all my pets including but not limited to multiple Supreme Grand Champion. $1995 adoption fee for pet homes for females and when they go to their new homes my quality kittens will have; Parental Genetic Testing, Parental Blood Tests and Health Screenings, Veterinarian Health Examination and Veterinarian Health Certification Certificate, and Multiple Current Vaccinations, Multiple Blood Tests, Health Guarantee and it is all in writing! These kittens come from parents with a Genuine multiple generation pedigree, TICA Registration, and more. Previous litters have been Blue Mitted, Blue Lynx, Blue Bicolor, Seal BiColor, Seal Point, Seal Mitted, Colorpoint, Chocolate, Lilac and others. Please TEXT to get the quickest response or call 610-235-six446-no-spam-please or visit my site;\n\nragdollkittensdivine.com\n\n180120", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/F9Fh3fsKqS.jpg", "detail_url": "http://www.hoobly.com/wW6GZ/rose-genuine-ragdoll-female-seal-bicolor-kitten-for-sale-adoption-with-multiple-supreme-grand-champion-bloodlines-tica-pedigreed-purebred.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/F9Fh3fsKqS.jpg"]}, {"id": "1WVI8", "title": "Amore Ragdoll Male Seal Point Pointed Colorpoint Kitten For Sale Adoption With Multiple Supreme Grand Champion Bloodlines TICA Pedigreed Purebred", "desc": "Genuine male seal point colorpoint pointed Multiple Generation TICA Pedigreed Purebred Rag", "location": "Haines City, Florida", "posted": "2018-01-31", "updated": "2018-02-23", "breed": "Ragdoll", "price": "", "content": "Genuine male seal point colorpoint pointed Multiple Generation TICA Pedigreed Purebred Ragdoll Kitten raised with my five children and with my other cats with multiple Supreme Grand Champion Bloodlines and a dozen plus more awards and my dogs (dog and children friendly!) Suburban home hobby bred and raised with my five young children ages eight through seventeen. Excellent dispositions and unequaled temperaments; I can't stress enough how great it is that my Genuine Ragdoll Cats and Kittens are well socialized with my multiple children and other pets. My family raises top quality true TICA Ragdoll Cats and kittens - beware of the fakes - those without pedigrees (anyone can claim \"pure bred\" but without a pedigree to back it up - who knows what you are really getting!) or without registered parents! My cats were bred from breeders with multiple generations of their family being breeders and over fifty years combined experience to bring out the best in the breed. Over a dozen champion bloodlines are in all my pets including but not limited to multiple Supreme Grand Champion. $1995 adoption fee for pet homes for females and when they go to their new homes my quality kittens will have; Parental Genetic Testing, Parental Blood Tests and Health Screenings, Veterinarian Health Examination and Veterinarian Health Certification Certificate, and Multiple Current Vaccinations, Multiple Blood Tests, Health Guarantee and it is all in writing! These kittens come from parents with a Genuine multiple generation pedigree, TICA Registration, and more. Previous litters have been Blue Mitted, Blue Lynx, Blue Bicolor, Seal BiColor, Seal Point, Seal Mitted, Colorpoint, Chocolate, Lilac and others. Please TEXT to get the quickest response or call 610-235-six446-no-spam-please or visit my site;\n\nragdollkittensdivine.com\n\n183101", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/EUzOmifeGM.jpg", "detail_url": "http://www.hoobly.com/1WVI8/amore-ragdoll-male-seal-point-pointed-colorpoint-kitten-for-sale-adoption-with-multiple-supreme-grand-champion-bloodlines-tica-pedigreed-purebred.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/EUzOmifeGM.jpg"]}, {"id": "HU2Hb", "title": "Angel blue point pointed mitted male genuine ragdoll kitten for sale adoption with multiple supreme grand champion bloodlines and TICA Pedigree Purebred", "desc": "Angel a genuine male blue point mitted pointed Multiple Generation TICA Pedigreed Purebred", "location": "Haines City, Florida", "posted": "2018-01-19", "updated": "2018-02-23", "breed": "Ragdoll", "price": "", "content": "Angel a genuine male blue point mitted pointed Multiple Generation TICA Pedigreed Purebred Ragdoll Kitten raised with my five children and with my other cats with multiple Supreme Grand Champion Bloodlines and a dozen plus more awards and my dogs (dog and children friendly!) Suburban home hobby bred and raised with my five young children ages eight through seventeen. Excellent dispositions and unequaled temperaments; I can't stress enough how great it is that my Genuine Ragdoll Cats and Kittens are well socialized with my multiple children and other pets. My family raises top quality true TICA Ragdoll Cats and kittens - beware of the fakes - those without pedigrees (anyone can claim \"pure bred\" but without a pedigree to see to back it up - who knows what you are really getting!) or without registered parents! My cats were bred from breeders with multiple generations of their family being breeders and over fifty years combined experience to bring out the best in the breed. Over a dozen champion bloodlines are in all my pets including but not limited to multiple Supreme Grand Champion. $1995 adoption fee for pet homes for females and when they go to their new homes my quality kittens will have; Parental Genetic Testing, Parental Blood Tests and Health Screenings, Veterinarian Health Examination and Veterinarian Health Certification Certificate, and Multiple Current Vaccinations, Multiple Blood Tests, Health Guarantee and it is all in writing! Kitten comes from parents with a Genuine multiple generation pedigree, TICA Registration, and more. Previous litters have been Blue Mitted, Blue Lynx, Blue Bicolor, Seal BiColor, Seal Point, Seal Mitted, Colorpoint, Chocolate, Lilac and others. Please TEXT to get the quickest response or call 610-235-six446-no-spam-please or visit my site;\n\nragdollkittensdivine.com\n\n181901", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/WgUZWnQ50e.jpg", "detail_url": "http://www.hoobly.com/HU2Hb/angel-blue-point-pointed-mitted-male-genuine-ragdoll-kitten-for-sale-adoption-with-multiple-supreme-grand-champion-bloodlines-and-tica-pedigree-purebred.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/WgUZWnQ50e.jpg"]}, {"id": "arNu9", "title": "ragdoll kittens tica reg ready for new home!!!   sold!!!!", "desc": "I have beautiful Pure Ragdoll kittens  8 weeks old, TICA registered. first vaccine will be", "location": "Walled Lake, Michigan", "posted": "2017-07-29", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$650", "content": "I have beautiful Pure Ragdoll kittens  8 weeks old, TICA registered. first vaccine will be given dewormed litter trained feeding Neutro Source or Royal Canin  kitten food. sweet little kittens, little lap kittens I  one seal point  male  with blue eyes ,  Ready for new home!!!  CASH only upon pickup of new kitten,  make an appointment to see the kittens!!! call for more information 248-956-8933", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/6tAHvH9J80.jpg", "detail_url": "http://www.hoobly.com/arNu9/ragdoll-kittens-awesome-colors-ready-for-new-home.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/6tAHvH9J80.jpg"]}, {"id": "YVKTk", "title": "TICA registered kittens ready for new home!!!", "desc": "I have gorgeous  female cream point with blue eyes;  one  female  Sepia torte point  with ", "location": "Walled Lake, Michigan", "posted": "2017-11-07", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$650", "content": "I have gorgeous  female cream point with blue eyes;  one  female  Sepia torte point  with  mittens , two blue point mitted males, all are 8- 9 weeks old litter trained,  veterinarian checked healthy!!! you will receive a health record, they will have their first  distemper vaccine, deworming before they leave to new home beautiful  markings lap kittens and will be ready for new home now!!!!!!!!!!!  make an appoint to see the kittens. CASH  upon pick up of kitten,  registered TICA papers upon pick up of kitten  visit my web site myragdollspersians.jigsy.com call for more information 248-956-8933", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/0HBPt8MLXf.jpg", "detail_url": "http://www.hoobly.com/YVKTk/ragdoll-kittens-purebred-tica-registered-ready-for-new-home.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/0HBPt8MLXf.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/2D2lcNMFFk.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/2xpLtbKj4R.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/8RQnfFm21i.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/vKOvs3J5Ef.jpg"]}, {"id": "1z5Qb", "title": "* KITTEN * one of a kind mink calico silky ragdoll x angora persian va nc md dc newport news va beach yorktown poquoson hampton chesapeake va beach district of columbia carrollton va", "desc": "She is a one of a kind Mink Calico (in the front of the pic) with Silky (not cottony) fur!", "location": "Carrollton, Virginia", "posted": "2017-07-15", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$995", "content": "She is a one of a kind Mink Calico (in the front of the pic) with Silky (not cottony) fur! GORGEOUS\n\n1st shots & wormed\n\nPlease have landlord approval and agreement between household members...\n\npamelacargile@gmail dot com", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/iv1NUXcb1U.jpg", "detail_url": "http://www.hoobly.com/1z5Qb/new-pics-kitten-one-of-a-kind-mink-calico-silky-angora-persian-x-rd-va-nc-md-dc-newport-news-va-beach-yorktown-poquoson-hampton-chesapeake-va-beach-district-of-columbia-carrollton-va-dc.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/8wBDoB3Epe.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/iv1NUXcb1U.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/olShD5Z4bX.jpg"]}, {"id": "evsLD", "title": "Himalayan/Ragdoll kittens", "desc": "Male blue point born 1/21. Deposits can be made to reserve your kitten. Hey check, Shots &", "location": "Reading, Pennsylvania", "posted": "2016-09-14", "updated": "2018-02-24", "breed": "Ragdoll", "price": "$850", "content": "Male blue point born 1/21. Deposits can be made to reserve your kitten. Hey check, Shots & deworming provided. Contact Me @ 4842191793 or visit Www.felinepurrrfection.com  for additional info.", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/OUProo1kTy.jpg", "detail_url": "http://www.hoobly.com/evsLD/himalayan-ragdoll-kittens.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/OUProo1kTy.jpg"]}, {"id": "zrEHP", "title": "Ragdoll juveniles and kittens available!", "desc": "Genotype Cats has beautiful babies prepared to be reserved! Kittens are individually price", "location": "Tuscaloosa, Alabama", "posted": "2017-07-03", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$1,000", "content": "Genotype Cats has beautiful babies prepared to be reserved! Kittens are individually priced starting at $1000 and all kittens with limited TICA registration with either a spay/neuter contract or required spay/neuter before leaving for a $100 additional fee. A $200 non-refundable deposit is required to reserve one of the babies. Photos and videos of the kittens appear on our facebook page: www.facebook.com/genotypecats/\n\nThe kittens will be available to go home at 12 weeks and will be vaccinated while they are with me but they will require their final vaccinations once in your home. The kittens are sold as limited registration through TICA (paperwork will be supplied to the buyer upon proof of spay/neuter), any buyer interested in full registration (with breeding rights) should mention this in our initial conversation. There will be an additional fee for full registration.\n\nThe kittens will receive a bill of good health from my veterinarian prior to heading to their new homes and a vet visit is required within 72 hours of when you pick-up your kitten (proof of the visit is required). We do provide a health warranty for full refund within 72 hours if your vet deems the kitten unsuitable for sale (with documentation required from your vet and potentially a second opinion from mine) and it should be stated that health issues are the only valid cause for any refund. Our health guarantee supports our belief that we are producing healthy off-spring and that we want to know if any of our kittens show signs of genetically related issues. Thus, if your kitten or cat is diagnosed with a serious genetic defect or congenital disease before 2 years of age we will provide a replacement kitten and work with you to determine the best option for the sick kitten or cat. The types of conditions that would be included as a genetic defect of congenital disease would be life-threatening heart conditions and degenerative nerve disorders (in other words, conditions that effect longevity or quality of life; allergies and innocent heart murmurs do not fall into this category).\n\nPhotos are of the kittens are of some of our past kittens.\n\nGenotype Cats\nwww.genotypecats.com\n\nwww.tranquillhedgies.com\nwww.paradigmpups.com", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/JFK6gGNeW1.jpg", "detail_url": "http://www.hoobly.com/zrEHP/ragdoll-juveniles-and-kittens-available-three-ready-to-go-anytime.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/4PCLXtYLca.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/JFK6gGNeW1.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/KzhkFgjlRG.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/PyNKfdp0xC.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/ZO1u0TEcDM.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/aXsR52c2Nc.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/ha4eICgzff.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/qmVXBu1a3D.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/qyfy8nUVTp.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/w9Xi4WXSs5.jpg"]}, {"id": "TpRGd", "title": "Ragdoll Kittens", "desc": "1 girl 2 boy doing great growing fast\r\nThey have a two year genetic health guarantee \r\n\r\n\r", "location": "Fort Wayne, Indiana", "posted": "2017-10-03", "updated": "2018-02-25", "breed": "Ragdoll", "price": "$700", "content": "1 girl 2 boy doing great growing fast\r\nThey have a two year genetic health guarantee\n\nKittens are growing so fast lots of playing current on shots and wormings litter box trained.Very Social.\n\nNo breeding rights\n\nBoth parents have been HCM cleared\n\nKittens are current with shots and worming to age.\n\nTICA registered\n\nLovely colors and markings. Home raised in a smoke-free environment, loved and very well socialized.\n\nKittens have awesome personalites.\n\nMom is a Chocolate Lynx  and Dad is Sealpoint mitted\n\nNo kitten is considered sold until deposit is received.\n\nBe sure to tell us you saw our ad on CatsForYou.com / BreedersClub.net\n\nThank you for your interest in our Ragdolls", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/KwpXk05PdK.jpg", "detail_url": "http://www.hoobly.com/TpRGd/ragdoll-kittens.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/EKgrPoYNDc.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/KwpXk05PdK.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/Od2bHgvvjy.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/gNYQg0we2z.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/hN2JIfpqZu.jpg"]}, {"id": "afXdo", "title": "Ragdoll kittens", "desc": "Health guarantee, Tica registered, Loving kittens. Vet checked age appropriate vaccines, d", "location": "Cincinnati, Ohio", "posted": "2018-02-23", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$500", "content": "Health guarantee, Tica registered, Loving kittens. Vet checked age appropriate vaccines, desexed, all paperwork, month supply of food.\nBluegrassbelties.com our website\r\nKatie Martin-Sorrell and Bluegrass Beauties Ragdolls are my Facebook pages.\r\nCheck out our babies!\r\nWe are expecting litters all spring. Discounts to Special Needs families, Military families and those in need of therapy cats.", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/BTJEGcqO03.jpg", "detail_url": "http://www.hoobly.com/afXdo/ragdoll-kittens.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/BTJEGcqO03.jpg"]}, {"id": "4WF97", "title": "Ragdoll kittens", "desc": "$700 male or female. 11 week litter, 8 week litter and 4 week old litter.\r\nVet checked wit", "location": "Dayton, Ohio", "posted": "2017-08-03", "updated": "2018-02-23", "breed": "Ragdoll", "price": "$700", "content": "$700 male or female. 11 week litter, 8 week litter and 4 week old litter.\r\nVet checked with paperwork and age appropriate vaccinations. Will be desexed. Tica all parents tested for Genetics Health issues.\r\nThank you.\r\nKatie\nBluegrassbelties.com is our\r\nWebsite", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/jePJeM3MtP.jpg", "detail_url": "http://www.hoobly.com/4WF97/ragdoll-kittens.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/Iprs37jRBm.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/Us80ka0gJn.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/jePJeM3MtP.jpg"]}, {"id": "Kd3Kl", "title": "ragdoll mix", "desc": "TORTIE FEMALE NOT SPAYED.\r\n she came from a breeder.  Do not have her siblings. She came f", "location": "Livonia, Michigan", "posted": "2018-02-02", "updated": "2018-02-22", "breed": "Ragdoll", "price": "", "content": "TORTIE FEMALE NOT SPAYED.  she came from a breeder.  Do not have her siblings. She came from an imperial dad and a smaller sized female.  Mom was registered. She is not being sold as a breeder. She is healthy. She is good with other small cats but not so much big ones. Big Joe keeps beating her up(18 lbs).  Would like to find her a home that can let her be happy and not picked on.  she may be ok with a small adult dog that is cat friendly.  strictly a house kitty and a no declaw agreement for her. Shot papers go with. On revolution flea prevention.\r\nshe is a cuddly flop cat\r\nno shipping pick up only\r\nout of state welcomed\r\ncash only!!!!!- usa money  no credit cards/checks/pay pal/ money orders/bitcom/pennies/yuros/ etc.\n\n400 dollars cash\r\nHer things go with", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/mnig9qh1Jh.jpg", "detail_url": "http://www.hoobly.com/Kd3Kl/ragdoll-mix.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/mnig9qh1Jh.jpg"]}, {"id": "Oijoq", "title": "Noel Genuine Ragdoll Female Seal Point Mitted Pointed Kitten For Sale Adoption With Multiple Supreme Grand Champion Bloodlines TICA Pedigreed Purebred", "desc": "Noel a genuine female seal point mitted pointed Multiple Generation TICA Pedigreed Purebre", "location": "Haines City, Florida", "posted": "2017-12-15", "updated": "2018-02-22", "breed": "Ragdoll", "price": "", "content": "Noel a genuine female seal point mitted pointed Multiple Generation TICA Pedigreed Purebred Ragdoll Kitten raised with my five children and with my other cats with multiple Supreme Grand Champion Bloodlines and a dozen plus more awards and my dogs (dog and children friendly!) can go home January 26th or later if desired. Suburban home hobby bred and raised with my five young children ages eight through seventeen. Excellent dispositions and unequaled temperaments; I can't stress enough how great it is that my Genuine Ragdoll Cats and Kittens are well socialized with my multiple children and other pets. My family raises top quality true TICA Ragdoll Cats and kittens - beware of the fakes - those without pedigrees (anyone can claim \"pure bred\" but without a pedigree to back it up - who knows what you are really getting!) or without registered parents! My cats were bred from breeders with multiple generations of their family being breeders and over fifty years combined experience to bring out the best in the breed. Over a dozen champion bloodlines are in all my pets including but not limited to multiple Supreme Grand Champion. $1995 adoption fee for pet homes for females and when they go to their new homes my quality kittens will have; Parental Genetic Testing, Parental Blood Tests and Health Screenings, Veterinarian Health Examination and Veterinarian Health Certification Certificate, and Multiple Current Vaccinations, Multiple Blood Tests, Health Guarantee and it is all in writing! These kittens come from parents with a Genuine multiple generation pedigree, TICA Registration, and more. Previous litters have been Blue Mitted, Blue Lynx, Blue Bicolor, Seal BiColor, Seal Point, Seal Mitted, Colorpoint, Chocolate, Lilac and others. Please TEXT to get the quickest response or call 610-235-six446-no-spam-please or visit my site;\n\nragdollkittensdivine.com\n\n171215", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/F7E7qSqIpD.jpg", "detail_url": "http://www.hoobly.com/Oijoq/noel-genuine-ragdoll-female-seal-point-mitted-pointed-kitten-for-sale-adoption-with-multiple-supreme-grand-champion-bloodlines-tica-pedigreed-purebred.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/F7E7qSqIpD.jpg"]}, {"id": "dhHjK", "title": "Five Genuine Ragdoll Kittens kittens for sale adoption seal chocolate blue lilac pointed point mitted bicolor colorpoint male female genuine tica cfa pedigree pedigreed", "desc": "Five Genuine Ragdoll Kittens available. Multiple Generation TICA Pedigreed with multiple S", "location": "Haines City, Florida", "posted": "2017-06-26", "updated": "2018-02-22", "breed": "Ragdoll", "price": "", "content": "Five Genuine Ragdoll Kittens available. Multiple Generation TICA Pedigreed with multiple Supreme Grand Champion Bloodlines and a dozen more awards that are being raised with my five children, cats, and dogs so they're cat, dog and children friendly that can go home in March (or later if you prefer). Suburban home hobby bred and raised with my five young children ages eight through seventeen. Excellent dispositions and unequaled temperaments; I can't stress enough how great it is that my Genuine Ragdoll Cats and Kittens are well socialized with my multiple children and other pets. My family raises top quality true TICA Ragdoll Cats and kittens - beware of the fakes - those without pedigrees (anyone can claim \"pure bred\" but without a pedigree to back it up - who knows what you are really getting!) or without registered parents! My cats were bred from breeders with multiple generations of their family being breeders and over fifty years combined experience to bring out the best in the breed. Over a dozen champion bloodlines are in all my pets including but not limited to multiple Supreme Grand Champion, multiple Quadruple Grand Champion, multiple Triple Grand Champion and Grand Champion. $1995 adoption fee for pet homes for females and when they go to their new homes my quality kittens will have; Parental Genetic Testing, Parental Blood Tests and Health Screenings, Veterinarian Health Examination and Veterinarian Health Certification Certificate, and Multiple Current Vaccinations, Multiple Blood Tests, a Health and Genetic Guarantee and it is all in writing! These kittens come from parents with a Genuine multiple generation pedigree, TICA Registration, and more. Previous litters have been Blue Mitted, Blue Lynx, Blue Bicolor, Seal BiColor, Seal Point, Seal Mitted, Colorpoint, Chocolate, Lilac and others. Please text for quickest response or call 610-235-six446 or visit my site;\n\nragdollkittensdivine.com\r\n021818", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/oVTDSfoVUA.jpg", "detail_url": "http://www.hoobly.com/dhHjK/genuine-ragdoll-kittens-kittens-for-sale-adoption-due-end-of-june-seal-chocolate-blue-lilac-point-mitted-bicolor-colorpoint-male-female-genuine-tica-cfa-pedigree-pedigreed.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/5Xja9UIcud.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/Jr5sfLgEbm.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/T0jieZRr8D.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/UD8LKeWfex.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/WnRetozWBW.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/iAt0hpDLeo.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/oVTDSfoVUA.jpg"]}, {"id": "NbNuI", "title": "New!!!Elite ragdoll kitten from Europe with excellent pedigree. In excellent breed type. Masha Marfa", "desc": "New!!!Elite ragdoll kitten from Europe with excellent pedigree. In excellent breed type. F", "location": "Brooklyn, New York", "posted": "2017-02-21", "updated": "2018-02-22", "breed": "Ragdoll", "price": "$3,000", "content": "New!!!Elite ragdoll kitten from Europe with excellent pedigree. In excellent breed type. Female . DOB 09.20.16. Can ship to any state or worldwide. Dewormed and vaccinated. Please call 347-387-1796 or Email Email Me Here. Please check our web site for complete listing: www.catsdogs.us . We provide 180 days warranty on all our kittens and puppies!\r\nNYPD 1020", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/dKfzAdnCkb.jpg", "detail_url": "http://www.hoobly.com/NbNuI/new-elite-ragdoll-kitten-from-europe-with-excellent-pedigree-in-excellent-breed-type-masha-marfa.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/1y2JA07bWW.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/6iAQg670Zg.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/D7Nltc5gw8.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/I4PmPSLV3k.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/QUgoSUEuBu.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/Sfb4AiPyuY.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/bCLCc5sRFl.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/dKfzAdnCkb.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/n0UpybkQu9.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/oW5G4ZKmRW.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/owhYXYfrMO.jpg"]}, {"id": "UpL3T", "title": "Ragdoll Kittens", "desc": "Ragdoll Kittens, seal mink and blue mink available, $800-900 +tax,  please visit our websi", "location": "Brownton, Minnesota", "posted": "2017-02-20", "updated": "2018-02-22", "breed": "Ragdoll", "price": "", "content": "Ragdoll Kittens, seal mink and blue mink available, $800-900 +tax,  please visit our website www.lakesideragdolls.com for more pictures and info, shots, vet checked, litter box trained, written health guarantee, kitten pack, family raised around 4 young children and 2 dogs, mom & dad are registered with TICA, the kitten price is pet price no papers, if you are looking for papers please call so we can discuss. 320-296-3561 www.lakesideragdolls.com", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/5WOoNoJeKO.jpg", "detail_url": "http://www.hoobly.com/UpL3T/ragdoll-kitten.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/5WOoNoJeKO.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/ixxUaHqFcC.jpg"]}, {"id": "5Tril", "title": "Beautiful Full Pedigree Ragdoll", "desc": "We are Tica & GCCF registered PearllDolls experienced Ragdoll cattery. We have 3 ragdoll k", "location": "Sacramento, California", "posted": "2018-02-22", "updated": "2018-02-22", "breed": "Ragdoll", "price": "", "content": "We are Tica & GCCF registered PearllDolls experienced Ragdoll cattery. We have 3 ragdoll kittens available. They are very sweet and lovely kittens, always come and have a nice purr. They have nice blue eyes, good ragdoll profile. Very good temperament. All our kittens and cats are raised at home with children, very socialized, placid and litter trained as well as friendly. Our kittens leave us fully vaccinated, de-wormed, micro-chipped\r\nTica registration 4 weeks PetPlan insurance\n\nFor more information text (816) 265-1356", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/V3kafyjKrT.jpg", "detail_url": "http://www.hoobly.com/5Tril/beautiful-full-pedigree-ragdoll.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/V3kafyjKrT.jpg"]}, {"id": "CuqV0", "title": "Himalayan Ragdoll kittens", "desc": "New baby alert! 1 male blue point born 2/21/2018 Vet check, Shots & deworming provided. Co", "location": "Reading, Pennsylvania", "posted": "2015-08-27", "updated": "2018-02-22", "breed": "Ragdoll", "price": "$850", "content": "New baby alert! 1 male blue point born 2/21/2018 Vet check, Shots & deworming provided. Contact Me @ 4842191793 or visit Www.felinepurrrfection.com  for additional info. Mother and Father listed in first 2  pictures", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/G8G92lmxE5.jpg", "detail_url": "http://www.hoobly.com/CuqV0/himalayan-ragdoll-kittens.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/G8G92lmxE5.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/awUbMf1Mza.jpg"]}, {"id": "f1qy2", "title": "♥ tica ragdoll kittens available ♥", "desc": "♥♥♥ 8 weeks old and 7 weeks old ♥♥♥\r\n Winter Blues kittens can go home after F", "location": "Youngstown, Ohio", "posted": "2018-01-29", "updated": "2018-02-22", "breed": "Ragdoll", "price": "$1,200", "content": "♥♥♥ 8 weeks old and 7 weeks old ♥♥♥  Winter Blues kittens can go home after February 22nd.  Boy Tribe kittens can go home after February 24th.\n\nAll of these kittens are blue point lynx and chocolate point Lynx TICA ragdoll kittens. Some are mitted and some have a blaze.  They are the sweetest babies ever. Purring as soon as you pick them up and wanting to cuddle and be held.\n\nPet only pricing is $1200.00. Our kittens come with a THREE year health guarantee when on NuVet (please see our kitten contract on website).\n\n$200.00 deposit required to reserve a kitten.\n\n♥ For updates and to see all photos please visit our facebook page www.facebook.com/kingskittiesragdolls/\n\nWe invite you to visit our website for pricing, to view our kitten contract or for more info on this amazing breed! kingskittiesragdolls.weebly.com/\n\nHoobly is a wonderful site, however at times messages do not come through... it is always best to contact us using text (330*503*3243) or website or FB messages. Thanks so much! Blessings!!", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/xZDll6CsWo.jpg", "detail_url": "http://www.hoobly.com/f1qy2/winter-blues-kittens-and-boy-tribe-kittens.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/7ZkBkIrg9L.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/8t2wvP08cc.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/9UR8epBRfP.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/LXN3tP5Cpa.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/N5SWKvFZwm.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/NmlyPC85WL.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/S5MHFQ1I7v.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/ev0MCtQXSd.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/ry2mat5LhB.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/xZDll6CsWo.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/yg8RNZpEoj.jpg"]}, {"id": "mWhds", "title": "Rare blue lynx MINK  ragdoll tica pedigree location : florida", "desc": "Gorgeous little Ragdoll boy , very smart and affectionate , playful , loves to be held , a", "location": "Orlando, Florida", "posted": "2017-08-15", "updated": "2018-02-21", "breed": "Ragdoll", "price": "$1,400", "content": "Gorgeous little Ragdoll boy , very smart and affectionate , playful , loves to be held , adores kisses\n\nBlue Lynx Mink with Teal Blue eyes\n\nIf interest , leave text message\n\n239 200 31 52\r\nWe do fly ...\r\nThis little boy is spoken for", "main_img_url": "http://s3.amazonaws.com/pics.hoobly.com/full/uSLPjkbH88.jpg", "detail_url": "http://www.hoobly.com/mWhds/rare-blue-lynx-mink-weeks-ragdoll-tica-pedigree.htm", "img_urls": ["http://s3.amazonaws.com/pics.hoobly.com/full/gAkp81BF0J.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/jBuzghpon8.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/sWgx3u58cI.jpg", "http://s3.amazonaws.com/pics.hoobly.com/full/uSLPjkbH88.jpg"]}]